"""Created on Fri Jul  8 17:24:40 2022.

@author: Mrlily
参数
"""

import numpy as np
import pandas as pd

col_n = ['体检例数', '腔内超声检查', '图文报告', '超声检查正常(包括双胎)',
         '双胎加收', '三维', "超声检查(胎儿系统)", "胎儿心脏超声",
         '残余尿测定', "床旁彩超加收", 'B超常规检', "脏器声学造影",
         '临床操作超声引导', '弹性成像' "介入操作",]


# 对比检查项目

jiancxm_tihuan = {'妇科生殖经腹':'肝胆', '早孕经腹':"肝胆", "体表包块":'肝胆',
                  '双侧腋下区及腋下淋巴结':'肝胆', '双侧锁骨上窝区及淋巴结':'肝胆',
                  '双眼及附属器':'肝胆', '双颈部及淋巴结':'肝胆', '手部':'肝胆',
                  '甲状腺及颈部淋巴结':'肝胆', '腮腺及周围淋巴结':'肝胆',
                  '腹股沟区':'肝胆', '膝关节':'肝胆', '阑尾区':'肝胆',
                  '肛周':'肝胆', '乳腺及腋下淋巴结':'肝胆', '泌尿系':'肝胆',
                  '肾上腺':'肝胆', '阴囊（睾丸附睾精索':'肝胆', '颌下腺及周围淋巴结':'肝胆',
                  '子宫附件经腹':'肝胆', '胃肠道':'肝胆', '腹水':'肝胆',
                  '早孕经阴道':'肝胆', '甲状旁腺':'肝胆', '臀部':'肝胆',
                  '泌尿系(双肾输尿管膀胱前列腺':'肝胆','阴茎':'肝胆',
                  '胸水':'肝胆','前列腺及精囊经腹':'肝胆','足部':'肝胆',
                  '髋关节':'肝胆',}

# '':'髋关节',


jiancxm_old = '''
其他(特殊指定部位
子宫附件经阴道
床旁彩超(一个部位
床旁彩超(二个部位
床旁彩超（三个部位
泌尿系及膀胱残余尿测定
胎儿
胎儿中晚期妊娠及子宫剖宫产瘢痕测定
胎儿中晚期妊娠彩超及宫颈长度经腹测量
胎儿心率测定
肝胆
膀胱残余尿测定
胎儿中晚期妊娠（双胎或多胎
'''

# print(jiancxm_old)