"""Created on Fri Jul  8 17:24:40 2022.

@author: Mrlily
参数
"""

import numpy as np
import pandas as pd

col_n = ['体检例数', '腔内超声检查', '图文报告', '超声检查正常(包括双胎)',
         '双胎加收', '三维', "超声检查(胎儿系统)", "胎儿心脏超声",
         '残余尿测定', "床旁彩超加收", 'B超常规检', "脏器声学造影",
         '临床操作超声引导', '弹性成像' "介入操作",]


#对比检查项目
'''
乳腺及腋下淋巴结
体表包块
其他(特殊指定部位
双侧腋下区及腋下淋巴结
双侧锁骨上窝区及淋巴结
双眼及附属器
双颈部及淋巴结
妇科生殖经腹
子宫附件经腹
子宫附件经阴道
床旁彩超(一个部位
床旁彩超(二个部位
床旁彩超（三个部位
床旁彩超（加收
手部
早孕经腹
泌尿系
泌尿系及膀胱残余尿测定
甲状腺及颈部淋巴结
肾上腺
胃肠道
胎儿
胎儿中晚期妊娠及子宫剖宫产瘢痕测定
胎儿中晚期妊娠彩超及宫颈长度经腹测量
胎儿心率测定
腮腺及周围淋巴结
腹股沟区
膝关节
阑尾区
阴囊（睾丸附睾精索
颌下腺及周围淋巴结
肛周
肝胆



'''